studygroup/app/controllers/authentication_controller.rb

SELECT "groups".* FROM "groups"
SELECT  "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "David"], ["LIMIT", 1]]
SELECT "groups".* FROM "groups" INNER JOIN "groups_users" ON "groups"."id" = "groups_users"."group_id" WHERE "groups_users"."user_id" = $1  [["user_id", 10]]
SELECT "users".* FROM "users" INNER JOIN "groups_users" ON "users"."id" = "groups_users"."user_id" WHERE "groups_users"."group_id" = $1  [["group_id", 1]]
---
  def login
    @groups = Group.all
    @user = User.find_by_name(params[:name])
    p @user
    if @user.authenticate(params[:password]) #authenticate method provided by Bcrypt and 'has_secure_password'
      token = encode(user_id: @user.id, name: @user.name)
      render json: { token: token, user: {id: @user.id, name: @user.name, groups: @user.groups,
      myGroups: @groups.select{|group| group.users[0].id === @user.id} } }, status: :ok