studygroup/app/controllers/groups_controller.rb

  def create
    @group = Group.new(group_params)
    @current_user.groups << @group
---
SELECT "groups".* FROM "groups" INNER JOIN "groups_users" ON "groups"."id" = "groups_users"."group_id" WHERE "groups_users"."user_id" = $1  [["user_id", 5]]
INSERT INTO "groups" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Riti Sharma"], ["description", "<3"], ["created_at", "2019-08-16 15:29:07.030195"], ["updated_at", "2019-08-16 15:29:07.030195"]]

  def update
    @group = Group.find(params[:id])
    if params[:user_id]
      @user = User.find(params[:user_id])
      @user.groups << @group
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def destroy
    @group = Group.find(params[:id])
    if params[:user_id]
      @user = User.find(params[:user_id])
      @user.groups.delete(@group)
    else
      @group.destroy
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "groups" WHERE "groups"."id" = $1  [["id", 2]]
DELETE FROM "groups" WHERE "groups"."id" = $1  [["id", 23]]