studygroup/app/controllers/posts_controller.rb

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
    @group = Group.find(params[:group_id])

SELECT "posts".* FROM "posts" WHERE "posts"."group_id" = $1  [["group_id", 1]]
---
  def show
    @group = Group.find(params[:group_id])
    @user = User.find(params[:user_id])
    @post = Post.find(params[:id])

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
INSERT INTO "posts" ("title", "message", "created_at", "updated_at", "user_id", "group_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Question"], ["message", "How do you do math?"], ["created_at", "2019-08-15 22:05:33.354110"], ["updated_at", "2019-08-15 22:05:33.354110"], ["user_id", 1], ["group_id", 1]]
---
  def create
    @group = Group.find(params[:group_id])
    @post = Post.new({ **post_params.as_json.symbolize_keys, group: @group})
    @post.user = @current_user
    @post.group = @group
    if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "title" = $1, "message" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["title", "Post"], ["message", "Dare you to edit this post. Did it loser"], ["updated_at", "2019-08-16 00:07:41.671389"], ["id", 5]]
---
  def update
    @post = Post.find(params[:id])
    if params[:group_id]
      @group = Group.find(params[:group_id])
      @group.post << @post
      render json: @post
    elsif @post.update(post_params)