studygroup/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "created_at", "updated_at", "password_digest", "email") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def verify
    @groups = Group.all
    @user = {
      id: @current_user[:id],
      name: @current_user[:name],
      email: @current_user[:email],
      groups: @current_user.groups,
      myGroups: @groups.select{|group| group.users[0].id === @current_user.id}
---
SELECT "groups".* FROM "groups"
SELECT "users".* FROM "users" INNER JOIN "groups_users" ON "users"."id" = "groups_users"."user_id" WHERE "groups_users"."group_id" = $1  [["group_id", 1]]